#Завдання 1

#Дано два рядки. Виведіть на екран символи, які є в обох рядках.

str1 = "qwerty"
str2 = "ertyui"

set1 = set(str1)
set2 = set(str2)

print(set1&set2)





# Завдання 2

# Створіть програму, яка емулює роботу сервісу зі скорочення посилань. Повинна бути реалізована можливість введення початкового посилання та короткої назви і отримання початкового посилання за її назвою.
#
# Завдання 3
#
# Створіть програму, яка має 2 списки цілочисельних значень та друкує список унікальних значень без повтору, які є в 1 списку (немає в другому) і навпаки.
#
# Завдання 4
#
# Ознайомтеся за допомогою документації з класами OrderedDict, defaultdict та ChainMap модуля collections.
#
# Завдання 5
#
# Є рядок, в якому зберігаються 1000 слів. Створіть словник із ключами - унікальними словами та значеннями - кількістю повторів кожного слова у послідовності.
#
# Завдання 6
#
# Створіть прототип програми «Бібліотека», де є можливість перегляду та внесення змін за структурою: автор: твір. Передбачте можливість виведення на екран сортування за автором та твором.
#
# Завдання 7
#
# Створіть прототип програми «Облік кадрів», в якій є можливість перегляду та внесення змін до структури(реалізуйте інтерфейс(меню), за допомогою якого можна робити маніпуляції з даними):
#
# прізвище:

#     посада: ...
#
#     досвід роботи: …
#
#     портфоліо: …
#
#     коефіцієнт ефективності: …
#
#     стек технологій: …
#
#     зарплата: …
#
# Передбачте можливість виведення на екран сортування за прізвищем та найефективнішим співробітником.